Repository: duxweb/dmux
Catalog: Sources/DmuxWorkspace/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans, zh_hant

# common.click_anywhere_to_close
source: Click anywhere to close
zh_hans: 点击任意处关闭
zh_hant: 點擊任意處關閉

# common.tap_to_continue
source: Tap to continue
zh_hans: 点击继续
zh_hant: 點擊繼續

# pet.attribute.wisdom
source: Wisdom
zh_hans: 智慧
zh_hant: 智慧

# pet.attribute.chaos
source: Chaos
zh_hans: 躁动
zh_hant: 躁動

# pet.attribute.night
source: Night
zh_hans: 夜行
zh_hant: 夜行

# pet.attribute.stamina
source: Stamina
zh_hans: 耐力
zh_hant: 耐力

# pet.attribute.empathy
source: Empathy
zh_hans: 共情
zh_hant: 共情

# pet.attribute.empathy.help
source: Reflects patient repair work, iterative debugging, and careful refinement.
zh_hans: 反映你最近是否更偏向耐心修补、反复调试和细致打磨。
zh_hant: 反映你最近是否更偏向耐心修補、反覆除錯和細緻打磨。

# pet.attribute.chaos.help
source: Reflects fast, jumpy, high-tempo sessions with frequent bursts.
zh_hans: 反映你最近是否更偏向短促、高频、节奏快的使用方式。
zh_hant: 反映你最近是否更偏向短促、高頻、節奏快的使用方式。

# pet.attribute.night.help
source: Reflects how much of your recent activity leans into late-night hours.
zh_hans: 反映你最近的活跃时间有多少更偏向深夜时段。
zh_hant: 反映你最近的活躍時間有多少更偏向深夜時段。

# pet.attribute.stamina.help
source: Reflects steadier sessions that hold focus across more sustained back-and-forth.
zh_hans: 反映你最近是否更偏向持续、稳一点、来回多轮的会话。
zh_hant: 反映你最近是否更偏向持續、穩一點、來回多輪的會話。

# pet.attribute.wisdom.help
source: Reflects deeper, denser sessions with more substantial exchanges.
zh_hans: 反映你最近是否更偏向深度更高、内容更密的对话。
zh_hant: 反映你最近是否更偏向深度更高、內容更密的對話。

# pet.claim.random.title
source: Random
zh_hans: 随机
zh_hant: 隨機

# pet.claim.voidcat.subtitle
source: Focused, quiet, late-night company
zh_hans: 专注、安静、夜间陪伴
zh_hant: 專注、安靜、夜間陪伴

# pet.claim.rusthound.subtitle
source: Warm, steady, keeps moving
zh_hans: 热情、稳定、持续推进
zh_hant: 熱情、穩定、持續推進

# pet.claim.goose.subtitle
source: Relaxed, gentle, steady rhythm
zh_hans: 轻松、治愈、节奏稳定
zh_hant: 輕鬆、療癒、節奏穩定

# pet.claim.random.subtitle
source: Let Codux choose a companion
zh_hans: 随机选择一个伙伴
zh_hant: 隨機選擇一個夥伴

# pet.claim.voidcat.description
source: A quiet coding companion for long thoughts and late nights.
zh_hans: 适合长时间思考和深夜工作的安静伙伴。
zh_hant: 適合長時間思考和深夜工作的安靜夥伴。

# pet.claim.rusthound.description
source: A steady companion that keeps going after every failed run.
zh_hans: 每次失败后都会继续推进的稳定伙伴。
zh_hant: 每次失敗後都會繼續推進的穩定夥伴。

# pet.claim.goose.description
source: A relaxed companion with a soft, steady rhythm.
zh_hans: 节奏轻松稳定的治愈系伙伴。
zh_hant: 節奏輕鬆穩定的療癒系夥伴。

# pet.claim.random.description
source: Let Codux choose one companion for you.
zh_hans: 让 Codux 为你随机选择一个伙伴。
zh_hant: 讓 Codux 為你隨機選擇一個夥伴。

# pet.claim.dialog.title
source: Choose a Pet
zh_hans: 选择宠物
zh_hant: 選擇寵物

# pet.claim.dialog.subtitle
source: A tiny coding partner for your workspace
zh_hans: 为工作区选择一个小小编码伙伴
zh_hant: 為工作區選擇一個小小編碼夥伴

# pet.claim.name.label
source: Give it a name (optional)
zh_hans: 给它起个名字（可选）
zh_hant: 給它起個名字（可選）

# pet.claim.name.placeholder
source: Leave empty to use the species name
zh_hans: 留空则使用物种名
zh_hant: 留空則使用物種名

# pet.claim.confirm
source: Confirm Claim
zh_hans: 确认领取
zh_hant: 確認領取

# pet.claim.window.title
source: Claim Pet
zh_hans: 领取宠物
zh_hant: 領取寵物

# pet.title.claim
source: Claim
zh_hans: 领取
zh_hant: 領取

# pet.name.placeholder
source: Pet Name
zh_hans: 宠物名称
zh_hant: 寵物名稱

# pet.dex.open
source: Open Dex
zh_hans: 打开图鉴
zh_hant: 打開圖鑑

# pet.xp.label
source: Experience
zh_hans: 经验值
zh_hant: 經驗值

# pet.stats.title
source: Traits
zh_hans: 性格属性
zh_hant: 性格屬性

# pet.total_xp
source: Total XP
zh_hans: 总 XP
zh_hant: 總 XP

# pet.next_stage
source: Next Stage
zh_hans: 下一阶段
zh_hant: 下一階段

# pet.dex.window.title
source: Pet Dex
zh_hans: 宠物图鉴
zh_hant: 寵物圖鑑

# pet.dex.title
source: Pet Dex
zh_hans: 宠物图鉴
zh_hant: 寵物圖鑑

# pet.dex.subtitle
source: A record of every coding companion you've raised
zh_hans: 记录你所有的编程伙伴
zh_hant: 記錄你所有的編程夥伴

# pet.dex.current_companion
source: Current Companion
zh_hans: 当前陪伴
zh_hant: 當前陪伴

# pet.dex.unclaimed
source: Not Claimed
zh_hans: 未领取
zh_hant: 未領取

# pet.dex.collection
source: Dex Collection
zh_hans: 图鉴收集
zh_hant: 圖鑑收集

# pet.dex.collection.complete
source: All companions unlocked
zh_hans: 全部伙伴已解锁
zh_hant: 全部夥伴已解鎖

# pet.dex.collection.continue
source: Keep exploring
zh_hans: 继续探索
zh_hant: 繼續探索

# pet.dex.current_pet
source: Current Pet
zh_hans: 当前宠物
zh_hant: 當前寵物

# pet.dex.no_current_pet
source: No active pet yet
zh_hans: 还没有陪伴中的宠物
zh_hant: 還沒有陪伴中的寵物

# pet.dex.unlocked_count
source: %@/%@ unlocked
zh_hans: %@/%@ 已解锁
zh_hant: %@/%@ 已解鎖

# pet.dex.locked
source: Locked
zh_hans: 未拥有
zh_hant: 未擁有

# pet.bubble.voidcat.running
source: Lost in thought…
zh_hans: 好像在深思…
zh_hant: 好像在深思…

# pet.bubble.voidcat.error
source: Even the whiskers frowned
zh_hans: 也皱眉了
zh_hant: 也皺眉了

# pet.bubble.voidcat.complete
source: Done already
zh_hans: 完成了
zh_hant: 完成了

# pet.bubble.voidcat.big_session
source: That was a long train of thought
zh_hans: 这次思考用了很久
zh_hant: 這次思考用了很久

# pet.bubble.voidcat.active_session
source: You've been working for ages
zh_hans: 已经工作很久了
zh_hant: 已經工作很久了

# pet.bubble.voidcat.late_night
source: Still thinking deep into the night
zh_hans: 深夜了还在思考
zh_hant: 深夜了還在思考

# pet.bubble.voidcat.first_open
source: Good morning
zh_hans: 早上好
zh_hant: 早上好

# pet.bubble.rusthound.running
source: What are we thinking about?
zh_hans: 在想什么呢
zh_hant: 在想什麼呢

# pet.bubble.rusthound.error
source: Let's try that again
zh_hans: 再来一次吧
zh_hant: 再來一次吧

# pet.bubble.rusthound.complete
source: Nailed it!
zh_hans: 搞定！
zh_hant: 搞定！

# pet.bubble.rusthound.big_session
source: That was a huge chunk of work!
zh_hans: 好大一块工作！
zh_hant: 好大一塊工作！

# pet.bubble.rusthound.active_session
source: Maybe take a short break
zh_hans: 该休息一下了
zh_hant: 該休息一下了

# pet.bubble.rusthound.late_night
source: It's getting late
zh_hans: 夜深了
zh_hant: 夜深了

# pet.bubble.rusthound.first_open
source: *big stretch*
zh_hans: （伸了个懒腰）
zh_hant: （伸了個懶腰）

# pet.bubble.goose.running
source: *stares quietly*
zh_hans: （盯着看）
zh_hant: （盯著看）

# pet.bubble.goose.error
source: Looks stuck
zh_hans: 卡住了
zh_hant: 卡住了

# pet.bubble.goose.complete
source: *nods*
zh_hans: （点头）
zh_hant: （點頭）

# pet.bubble.goose.big_session
source: *big yawn*
zh_hans: （打了个哈欠）
zh_hant: （打了個哈欠）

# pet.bubble.goose.active_session
source: Getting tired?
zh_hans: 累了吗
zh_hant: 累了嗎

# pet.bubble.goose.late_night
source: It's midnight already…
zh_hans: 半夜了…
zh_hant: 半夜了…

# pet.bubble.goose.first_open
source: A brand-new day again
zh_hans: 又是新的一天
zh_hant: 又是新的一天

# pet.bubble.chaossprite.running
source: The ideas are about to burst
zh_hans: 灵感要炸开了
zh_hant: 靈感要炸開了

# pet.bubble.chaossprite.error
source: The chaos is getting rough
zh_hans: 乱流有点大
zh_hant: 亂流有點大

# pet.bubble.chaossprite.complete
source: Chaos restored to order
zh_hans: 混沌归位
zh_hant: 混沌歸位

# pet.bubble.chaossprite.big_session
source: That energy was intense
zh_hans: 这次能量很强
zh_hant: 這次能量很強

# pet.bubble.chaossprite.active_session
source: You've been burning bright for a while
zh_hans: 已经燃烧很久了
zh_hant: 已經燃燒很久了

# pet.bubble.chaossprite.late_night
source: Night is the best time to glow
zh_hans: 夜里最适合发光
zh_hant: 夜裡最適合發光

# pet.bubble.chaossprite.first_open
source: Time to sparkle again today
zh_hans: 今天也要闪一下
zh_hant: 今天也要閃一下

# settings.tab.pet
source: Pet
zh_hans: 宠物
zh_hant: 寵物

# settings.pet.section.general
source: General
zh_hans: 通用
zh_hant: 通用

# settings.ai_statistics_mode
source: AI Statistics Mode
zh_hans: AI 统计显示方式
zh_hant: AI 統計顯示方式

# settings.ai_statistics_mode.including_cache
source: Include Cache
zh_hans: 包含缓存
zh_hant: 包含快取

# settings.ai_statistics_mode.normalized
source: Exclude Cache
zh_hans: 不含缓存
zh_hant: 不含快取

# settings.pet.section.reminders
source: Reminders
zh_hans: 提醒
zh_hant: 提醒

# settings.pet.enabled
source: Enable Pet
zh_hans: 启用宠物
zh_hant: 啟用寵物

# settings.pet.static_mode
source: Static Pet Sprite
zh_hans: 静态宠物动画
zh_hant: 靜態寵物動畫

# settings.pet.desktop_widget
source: Desktop Pet
zh_hans: 桌面宠物
zh_hant: 桌面寵物

# pet.bubble.voidcat.hydration
source: A sip of water might help the thoughts flow
zh_hans: 喝点水，思路会更顺
zh_hant: 喝點水，思路會更順

# pet.bubble.rusthound.hydration
source: Water break, then straight back in
zh_hans: 先喝口水，再继续冲
zh_hant: 先喝口水，再繼續衝

# pet.bubble.goose.hydration
source: Maybe drink some water first?
zh_hans: 先去喝点水吧？
zh_hant: 先去喝點水吧？

# pet.bubble.chaossprite.hydration
source: Hydrate before the sparks get too wild
zh_hans: 先补水，火花才不会乱飞
zh_hant: 先補水，火花才不會亂飛

# memory.status.detail
source: Memory queue: %lld pending, %lld running
zh_hans: 记忆队列：%lld 个等待，%lld 个运行中
zh_hant: 記憶佇列：%lld 個等待，%lld 個執行中

# memory.status.failed
source: Memory failed
zh_hans: 记忆失败
zh_hant: 記憶失敗

# memory.status.idle
source: Memory idle
zh_hans: 记忆空闲
zh_hant: 記憶空閒

# memory.status.processing
source: Remembering
zh_hans: 记忆中
zh_hant: 記憶中

# memory.status.queued
source: Memory queued
zh_hans: 记忆排队
zh_hant: 記憶排隊

# memory.kind.bug_lesson
source: Bug Lesson
zh_hans: 问题经验
zh_hant: 問題經驗

# memory.kind.convention
source: Convention
zh_hans: 约定
zh_hant: 約定

# memory.kind.decision
source: Decision
zh_hans: 决策
zh_hant: 決策

# memory.kind.fact
source: Fact
zh_hans: 事实
zh_hant: 事實

# memory.kind.preference
source: Preference
zh_hans: 偏好
zh_hant: 偏好

# memory.manager.archive
source: Archive
zh_hans: 归档
zh_hant: 封存

# memory.manager.delete.confirm.message
source: This removes the selected memory from the local memory database.
zh_hans: 这会从本地记忆库中删除选中的记忆。
zh_hant: 這會從本機記憶庫中刪除選取的記憶。

# memory.manager.delete.confirm.title
source: Delete Memory
zh_hans: 删除记忆
zh_hant: 刪除記憶

# memory.manager.empty.entries
source: No memories in this view
zh_hans: 当前视图没有记忆
zh_hant: 目前視圖沒有記憶

# memory.manager.empty.entries.detail
source: Try another type tab or wait for memory extraction to complete.
zh_hans: 可以切换其他类型，或等待记忆提取完成。
zh_hant: 可以切換其他類型，或等待記憶擷取完成。

# memory.manager.empty.active
source: No active memories
zh_hans: 暂无活跃记忆
zh_hant: 暫無活躍記憶

# memory.manager.empty.active.detail
source: Fresh extracted memories appear here before they are compacted into summaries. Older compacted items remain in History.
zh_hans: 新提取的记忆会先显示在这里；被压缩进摘要后的旧条目仍可在历史记录中查看。
zh_hant: 新擷取的記憶會先顯示在這裡；被壓縮進摘要後的舊項目仍可在歷史記錄中查看。

# memory.manager.empty.history
source: No memory history
zh_hans: 暂无记忆历史
zh_hant: 暫無記憶歷史

# memory.manager.empty.history.detail
source: Merged and archived memories appear here after extraction compacts older entries.
zh_hans: 提取流程压缩旧条目后，已合并和已归档的记忆会显示在这里。
zh_hant: 擷取流程壓縮舊項目後，已合併和已封存的記憶會顯示在這裡。

# memory.manager.empty.summary
source: No summary memory
zh_hans: 暂无摘要记忆
zh_hant: 暫無摘要記憶

# memory.manager.empty.summary.detail
source: Summaries appear after extraction has enough useful context.
zh_hans: 提取到足够有用上下文后会生成摘要。
zh_hant: 擷取到足夠有用上下文後會生成摘要。

# memory.manager.edit_summary
source: Edit Summary
zh_hans: 编辑摘要
zh_hant: 編輯摘要

# memory.manager.edit_summary.detail
source: Changes are saved as a new summary version and used for future memory injection.
zh_hans: 修改会保存为新的摘要版本，并用于后续记忆注入。
zh_hant: 修改會儲存為新的摘要版本，並用於後續記憶注入。

# memory.manager.edit_summary.empty_error
source: Summary content cannot be empty.
zh_hans: 摘要内容不能为空。
zh_hant: 摘要內容不能為空。

# memory.manager.edit_summary.title
source: Edit Summary Memory
zh_hans: 编辑摘要记忆
zh_hant: 編輯摘要記憶

# memory.manager.error
source: Memory could not be loaded
zh_hans: 记忆加载失败
zh_hant: 記憶載入失敗

# memory.manager.index_now
source: Index Now
zh_hans: 立即索引
zh_hant: 立即索引

# memory.manager.index_now.help
source: Immediately scan completed AI sessions for memory extraction.
zh_hans: 立即扫描已完成的 AI 会话并提取记忆。
zh_hant: 立即掃描已完成的 AI 會話並擷取記憶。

# memory.manager.overview_format
source: %lld active, %lld archived, %lld summaries
zh_hans: %lld 条活跃，%lld 条归档，%lld 个摘要
zh_hant: %lld 條活躍，%lld 條封存，%lld 個摘要

# memory.manager.subtitle
source: Browse and clean extracted memories
zh_hans: 查看和清理已提取的记忆
zh_hant: 檢視和清理已擷取的記憶

# memory.manager.summary.sources_format
source: %lld source entries
zh_hans: %lld 条来源记忆
zh_hant: %lld 條來源記憶

# memory.manager.tab.archive
source: Archive
zh_hans: 归档
zh_hant: 封存

# memory.manager.tab.active
source: Memories
zh_hans: 记忆
zh_hant: 記憶

# memory.manager.tab.core
source: Core
zh_hans: 核心
zh_hant: 核心

# memory.manager.tab.history
source: History
zh_hans: 历史记录
zh_hant: 歷史記錄

# memory.manager.tab.summary
source: Summary
zh_hans: 摘要
zh_hant: 摘要

# memory.manager.tab.working
source: Working
zh_hans: 工作记忆
zh_hant: 工作記憶

# memory.manager.title
source: Memory
zh_hans: 记忆
zh_hant: 記憶

# memory.manager.unknown_project_format
source: Project %@
zh_hans: 项目 %@
zh_hant: 專案 %@

# memory.manager.user_memory
source: User Memory
zh_hans: 用户记忆
zh_hant: 使用者記憶

# memory.manager.user_memory.subtitle
source: Cross-project preferences
zh_hans: 跨项目偏好
zh_hant: 跨專案偏好

# memory.manager.window.title
source: Memory Manager
zh_hans: 记忆管理
zh_hant: 記憶管理

# memory.status.active
source: Active
zh_hans: 活跃
zh_hant: 活躍

# memory.status.archived
source: Archived
zh_hans: 已归档
zh_hant: 已封存

# memory.status.merged
source: Merged
zh_hans: 已合并
zh_hant: 已合併

# memory.tier.archive
source: Archive
zh_hans: 归档
zh_hant: 封存

# memory.tier.core
source: Core
zh_hans: 核心
zh_hant: 核心

# memory.tier.working
source: Working
zh_hans: 工作记忆
zh_hant: 工作記憶

# settings.ai.tool.configuration_format
source: %@ Configuration
zh_hans: %@ 配置
zh_hant: %@ 配置

# settings.ai.tool.default_model
source: Default Model
zh_hans: 默认模型
zh_hant: 預設模型

# settings.ai.global_prompt
source: Global Prompt
zh_hans: 全局提示词
zh_hant: 全域提示詞

# settings.ai.global_prompt_help
source: Injected when supported tools start. It is merged with memory context and written to each tool's launch context.
zh_hans: 支持的工具启动时注入，会和记忆上下文合并并写入对应工具的启动上下文。
zh_hant: 支援的工具啟動時注入，會和記憶上下文合併並寫入對應工具的啟動上下文。

# settings.ai.provider.add
source: Add API Channel
zh_hans: 添加 API 渠道
zh_hant: 新增 API 渠道

# settings.ai.provider.anthropic_help
source: Uses Anthropic Messages API at /v1/messages.
zh_hans: 使用 Anthropic Messages API 的 /v1/messages。
zh_hant: 使用 Anthropic Messages API 的 /v1/messages。

# settings.ai.provider.api_only_help
source: Local and API providers for memory extraction.
zh_hans: 用于记忆提取的本机和 API 提供方。
zh_hant: 用於記憶擷取的本機和 API 提供方。

# settings.ai.local_model.install
source: Install Model
zh_hans: 安装模型
zh_hant: 安裝模型

# settings.ai.local_model.remove
source: Remove Model
zh_hans: 移除模型
zh_hant: 移除模型

# settings.ai.local_model.status.downloading
source: Downloading
zh_hans: 下载中
zh_hant: 下載中

# settings.ai.local_model.status.failed
source: Failed
zh_hans: 失败
zh_hant: 失敗

# settings.ai.local_model.status.installed
source: Installed
zh_hans: 已安装
zh_hant: 已安裝

# settings.ai.local_model.status.not_installed
source: Not Installed
zh_hans: 未安装
zh_hant: 未安裝

# settings.ai.provider.name
source: Name
zh_hans: 名称
zh_hant: 名稱

# settings.ai.provider.openai_compatible_help
source: Use this for OpenAI, DeepSeek, and other /v1/chat/completions-compatible APIs.
zh_hans: 用于 OpenAI、DeepSeek 和其他兼容 /v1/chat/completions 的 API。
zh_hant: 用於 OpenAI、DeepSeek 和其他相容 /v1/chat/completions 的 API。

# settings.ai.provider.remove
source: Remove
zh_hans: 移除
zh_hant: 移除

# settings.ai.provider.test
source: Test
zh_hans: 测试
zh_hant: 測試

# settings.ai.provider.test.running
source: Testing…
zh_hans: 测试中…
zh_hant: 測試中…

# settings.ai.provider.test.succeeded_format
source: Test succeeded: %@
zh_hans: 测试成功：%@
zh_hant: 測試成功：%@

# settings.ai.provider.test.failed_format
source: Test failed: %@
zh_hans: 测试失败：%@
zh_hant: 測試失敗：%@

# pet.stage.companion
source: Companion
zh_hans: 伙伴
zh_hant: 夥伴

# pet.claim.chaossprite.subtitle
source: Ideas, motion, hidden energy
zh_hans: 灵感、变化、隐藏能量
zh_hant: 靈感、變化、隱藏能量

# pet.claim.code.subtitle
source: Coding, terminal, task runner
zh_hans: 编码、终端、任务执行
zh_hant: 編碼、終端、任務執行

# pet.claim.chaossprite.description
source: A bright companion for messy ideas and sudden turns.
zh_hans: 适合混乱灵感和突然转向的明亮伙伴。
zh_hant: 適合混亂靈感和突然轉向的明亮夥伴。

# pet.claim.code.description
source: A coding companion that keeps your terminal alive.
zh_hans: 让终端保持活力的编码伙伴。
zh_hant: 讓終端保持活力的編碼夥伴。

# pet.archive.alert.title
source: Archive Current Pet
zh_hans: 封存当前宠物
zh_hant: 封存目前寵物

# pet.archive.confirm
source: Confirm Archive
zh_hans: 确认封存
zh_hant: 確認封存

# pet.archive.alert.message
source: Archive this pet into the dex and choose a new companion.
zh_hans: 将当前宠物封存到图鉴，然后选择新的伙伴。
zh_hant: 將目前寵物封存到圖鑑，然後選擇新的夥伴。

# pet.archive.action
source: Archive
zh_hans: 封存
zh_hant: 封存

# pet.archive.history
source: Archive History
zh_hans: 封存历史
zh_hant: 封存歷史

# pet.dex.archived
source: Archived
zh_hans: 已封存
zh_hant: 已封存

# pet.dex.archived.none
source: No archived pets yet
zh_hans: 还没有封存记录
zh_hant: 還沒有封存記錄

# pet.dex.archived.history
source: Past companions
zh_hans: 过往伙伴
zh_hant: 過往夥伴

# pet.effect.max_level
source: Max Level
zh_hans: 满级
zh_hant: 滿級

# pet.effect.level_up
source: LEVEL UP
zh_hans: 升级
zh_hant: 升級

# ssh.credential.none
source: None / SSH Agent
zh_hans: 无 / SSH Agent
zh_hant: 無 / SSH Agent

# ssh.credential.password
source: Password
zh_hans: 密码
zh_hant: 密碼

# ssh.credential.private_key
source: Private Key
zh_hans: 私钥
zh_hant: 私鑰

# ssh.panel.empty.help
source: Add a global SSH profile and double-click it to connect in a terminal.
zh_hans: 添加全局 SSH 配置，双击即可在终端中连接。
zh_hant: 新增全域 SSH 設定，雙擊即可在終端中連線。

# ssh.panel.empty.title
source: No SSH Connections
zh_hans: 暂无 SSH 连接
zh_hant: 暫無 SSH 連線

# ssh.panel.subtitle
source: Global Connections
zh_hans: 全局连接
zh_hant: 全域連線

# ssh.profile.add
source: Add SSH Connection
zh_hans: 添加 SSH 连接
zh_hant: 新增 SSH 連線

# ssh.profile.choose_key.title
source: Choose Private Key
zh_hans: 选择私钥
zh_hant: 選擇私鑰

# ssh.profile.connect
source: Connect
zh_hans: 连接
zh_hant: 連線

# ssh.profile.connecting_format
source: Connecting to %@.
zh_hans: 正在连接 %@。
zh_hant: 正在連線 %@。

# ssh.profile.credential
source: Credential
zh_hans: 凭证
zh_hant: 憑證

# ssh.profile.deleted
source: Deleted SSH connection.
zh_hans: 已删除 SSH 连接。
zh_hant: 已刪除 SSH 連線。

# ssh.profile.delete
source: Delete SSH Connection
zh_hans: 删除 SSH 连接
zh_hant: 刪除 SSH 連線

# ssh.profile.delete.message_format
source: Delete %@? The saved local credential will also be removed.
zh_hans: 删除 %@？已保存的本地凭证也会一并移除。
zh_hant: 刪除 %@？已儲存的本機憑證也會一併移除。

# ssh.profile.dialog.message
source: Saved credentials are kept in Codux local app data.
zh_hans: 保存的凭证会存入 Codux 本地应用数据。
zh_hant: 儲存的憑證會存入 Codux 本機應用程式資料。

# ssh.profile.edit
source: Edit SSH Connection
zh_hans: 编辑 SSH 连接
zh_hant: 編輯 SSH 連線

# ssh.profile.host
source: Host
zh_hans: 主机
zh_hant: 主機

# ssh.profile.key_passphrase
source: Key Passphrase
zh_hans: 密钥口令
zh_hant: 金鑰密語

# ssh.profile.key_passphrase.placeholder
source: Optional, stored locally
zh_hans: 可选，本地保存
zh_hant: 可選，本機儲存

# ssh.profile.missing
source: SSH connection not found.
zh_hans: 未找到 SSH 连接。
zh_hant: 未找到 SSH 連線。

# ssh.profile.name
source: Name
zh_hans: 名称
zh_hant: 名稱

# ssh.profile.name.placeholder
source: Production Server
zh_hans: 生产服务器
zh_hant: 正式伺服器

# ssh.profile.password
source: Password
zh_hans: 密码
zh_hant: 密碼

# ssh.profile.password.placeholder
source: Stored locally
zh_hans: 本地保存
zh_hant: 本機儲存

# ssh.profile.port
source: Port
zh_hans: 端口
zh_hant: 連接埠

# ssh.profile.private_key
source: Private Key
zh_hans: 私钥
zh_hant: 私鑰

# ssh.profile.saved
source: Saved SSH connection.
zh_hans: 已保存 SSH 连接。
zh_hant: 已儲存 SSH 連線。

# ssh.profile.username
source: Username
zh_hans: 用户名
zh_hant: 使用者名稱

# pet.tooltip.pet
source: Pet
zh_hans: 宠物
zh_hant: 寵物

# pet.archive.available
source: Archive Pet
zh_hans: 封存宠物
zh_hant: 封存寵物

# pet.archive.success
source: Archived current pet.
zh_hans: 已封存当前宠物。
zh_hant: 已封存目前寵物。

# pet.archive.restore.action
source: Restore
zh_hans: 取回
zh_hant: 取回

# pet.archive.restore.success
source: Restored archived pet.
zh_hans: 已取回封存宠物。
zh_hant: 已取回封存寵物。

# pet.claim.action
source: Claim Pet
zh_hans: 领取宠物
zh_hant: 領取寵物

# pet.claim.success
source: Claimed pet.
zh_hans: 已领取宠物。
zh_hant: 已領取寵物。

# pet.claim.custom.subtitle
source: Installed custom pet
zh_hans: 已安装的自定义宠物
zh_hant: 已安裝的自訂寵物

# pet.claim.custom.description
source: A custom Codex-format companion installed from Petdex.
zh_hans: 从 Petdex 安装的 Codex 标准自定义伙伴。
zh_hant: 從 Petdex 安裝的 Codex 標準自訂夥伴。

# pet.claim.custom.section
source: Custom Pets
zh_hans: 自定义宠物
zh_hant: 自訂寵物

# pet.custom.missing
source: Custom Pet
zh_hans: 自定义宠物
zh_hant: 自訂寵物

# pet.custom.installed
source: Custom pet
zh_hans: 自定义宠物
zh_hant: 自訂寵物

# pet.custom.installed_count
source: %@ installed
zh_hans: 已安装 %@ 个
zh_hant: 已安裝 %@ 個

# pet.custom.install.action
source: Add Custom Pet
zh_hans: 添加自定义宠物
zh_hant: 新增自訂寵物

# pet.custom.install.title
source: Add Custom Pet
zh_hans: 添加自定义宠物
zh_hant: 新增自訂寵物

# pet.custom.install.subtitle
source: Install a Codex-format pet from Petdex.
zh_hans: 从 Petdex 安装 Codex 标准宠物素材。
zh_hant: 從 Petdex 安裝 Codex 標準寵物素材。

# pet.custom.install.url.label
source: Petdex Page URL
zh_hans: Petdex 页面地址
zh_hant: Petdex 頁面網址

# pet.custom.install.confirm
source: Install
zh_hans: 安装
zh_hant: 安裝

# pet.custom.install.installing
source: Installing...
zh_hans: 正在安装...
zh_hant: 正在安裝...

# pet.custom.install.success_format
source: Installed %@.
zh_hans: 已安装 %@。
zh_hant: 已安裝 %@。

# pet.custom.install.url_required
source: Please enter a Petdex pet page URL.
zh_hans: 请输入 Petdex 宠物页面地址。
zh_hant: 請輸入 Petdex 寵物頁面網址。

# pet.custom.install.invalid_url
source: Please enter a Petdex pet page URL.
zh_hans: 请输入 Petdex 宠物页面地址。
zh_hant: 請輸入 Petdex 寵物頁面網址。

# pet.custom.install.fetch_failed
source: Failed to load the Petdex page.
zh_hans: 无法加载 Petdex 页面。
zh_hant: 無法載入 Petdex 頁面。

# pet.custom.install.decode_failed
source: Unable to read the Petdex page.
zh_hans: 无法读取 Petdex 页面。
zh_hant: 無法讀取 Petdex 頁面。

# pet.custom.install.zip_missing
source: Unable to find a Petdex package on this page.
zh_hans: 这个页面没有找到 Petdex 宠物安装包。
zh_hant: 這個頁面沒有找到 Petdex 寵物安裝包。

# pet.custom.install.invalid_package
source: The Petdex package name is invalid.
zh_hans: Petdex 安装包名称无效。
zh_hant: Petdex 安裝包名稱無效。

# pet.custom.install.invalid_archive
source: The downloaded package does not contain a valid pet.json and spritesheet.
zh_hans: 下载的安装包缺少有效的 pet.json 或 spritesheet。
zh_hant: 下載的安裝包缺少有效的 pet.json 或 spritesheet。

# pet.custom.install.verify_failed
source: Installed pet package could not be verified.
zh_hans: 已安装的宠物素材校验失败。
zh_hant: 已安裝的寵物素材校驗失敗。

# pet.custom.install.download_failed
source: Failed to download the pet package.
zh_hans: 宠物安装包下载失败。
zh_hant: 寵物安裝包下載失敗。

# pet.custom.install.unzip_failed
source: Failed to unpack the pet package.
zh_hans: 宠物安装包解压失败。
zh_hant: 寵物安裝包解壓失敗。

# pet.dex.bundled.section
source: Bundled Pets
zh_hans: 内置宠物
zh_hant: 內建寵物

# pet.effect.max_level.detail
source: Your companion can keep growing.
zh_hans: 你的伙伴仍可继续成长。
zh_hant: 你的夥伴仍可繼續成長。

# pet.custom.market.action
source: Get Pets
zh_hans: 获取宠物
zh_hant: 取得寵物

# pet.custom.market.title
source: Petdex Marketplace
zh_hans: Petdex 宠物市场
zh_hant: Petdex 寵物市場

# pet.custom.market.detail
source: Pick a pet there, then paste its page URL here.
zh_hans: 在那里选择宠物，然后把页面地址粘贴到这里。
zh_hant: 在那裡選擇寵物，然後把頁面網址貼到這裡。

# pet.custom.market.url
source: https://petdex.crafter.run
zh_hans: https://petdex.crafter.run/zh
zh_hant: https://petdex.crafter.run/zh

# pet.custom.install.resolve
source: Parse
zh_hans: 解析
zh_hant: 解析

# pet.custom.install.resolve_again
source: Parse Again
zh_hans: 重新解析
zh_hant: 重新解析

# pet.custom.install.resolving
source: Reading Petdex page...
zh_hans: 正在读取 Petdex 页面...
zh_hant: 正在讀取 Petdex 頁面...

# pet.custom.install.installing.detail
source: Downloading, unpacking, and validating the pet package.
zh_hans: 正在下载、解压并校验宠物素材。
zh_hant: 正在下載、解壓並校驗寵物素材。

# pet.custom.install.installed
source: Installed
zh_hans: 已安装
zh_hant: 已安裝

# pet.custom.install.name.label
source: Pet Name
zh_hans: 宠物名称
zh_hant: 寵物名稱

# pet.custom.install.preview.label
source: Pet Preview
zh_hans: 宠物预览
zh_hant: 寵物預覽

# pet.custom.install.name_required
source: Please enter a pet name.
zh_hans: 请输入宠物名称。
zh_hant: 請輸入寵物名稱。

# pet.custom.install.validation.page
source: Petdex page verified
zh_hans: Petdex 页面已验证
zh_hant: Petdex 頁面已驗證

# pet.custom.install.validation.package
source: Package link found
zh_hans: 已找到安装包链接
zh_hant: 已找到安裝包連結
